coocox/Mplib/Toshaba/TMPM37x/TMPM376/cmsis_lib/lib/inc/tmpm376_gpio.h
#define IS_GPIO_PK_FUNCTION_REG(param)  (((param) == GPIO_FUNC_REG_1))

#define IS_GPIO_PL_FUNCTION_REG(param)  (((param) == GPIO_FUNC_REG_1))

#define IS_GPIO_PN_FUNCTION_REG(param)  (((param) == GPIO_FUNC_REG_1))
/** @} */
/* End of group GPIO_Parameter_Definition */

/** @defgroup GPIO_Bit_Define
  * @{
  */
#define GPIO_BIT_VALUE_1                ((uint8_t)0x01)
#define GPIO_BIT_VALUE_0                ((uint8_t)0x00)

#define IS_GPIO_BIT_VALUE(BitValue)     (((BitValue) == GPIO_BIT_VALUE_1)|| \
                                         ((BitValue) == GPIO_BIT_VALUE_0))

#define GPIO_BIT_0                      ((uint8_t)0x01)
#define GPIO_BIT_1                      ((uint8_t)0x02)
#define GPIO_BIT_2                      ((uint8_t)0x04)
#define GPIO_BIT_3                      ((uint8_t)0x08)
#define GPIO_BIT_4                      ((uint8_t)0x10)
#define GPIO_BIT_5                      ((uint8_t)0x20)
#define GPIO_BIT_6                      ((uint8_t)0x40)
#define GPIO_BIT_7                      ((uint8_t)0x80)
#define GPIO_BIT_ALL                    ((uint8_t)0xFF)

#define GPIO_PA_OUTPUT_BIT_ALL                   ((uint8_t)0xFF)
#define GPIO_PA_PULLUP_BIT_ALL                   ((uint8_t)0xFF)
#define GPIO_PA_PULLDOWN_BIT_ALL                 ((uint8_t)0xFF)
#define GPIO_PA_OPEN_DRAIN_BIT_ALL               ((uint8_t)0xFF)
#define GPIO_PA_INPUT_BIT_ALL                    ((uint8_t)0xFF)
#define GPIO_PA_FR1_BIT_ALL                      ((uint8_t)0xFF)
#define GPIO_PA_FR2_BIT_ALL                      ((uint8_t)0xF5)

#define GPIO_PB_OUTPUT_BIT_ALL                   ((uint8_t)0xFF)
#define GPIO_PB_PULLUP_BIT_ALL                   ((uint8_t)0xFF)
#define GPIO_PB_PULLDOWN_BIT_ALL                 ((uint8_t)0xFF)
#define GPIO_PB_OPEN_DRAIN_BIT_ALL               ((uint8_t)0xFF)
#define GPIO_PB_INPUT_BIT_ALL                    ((uint8_t)0xFF)
#define GPIO_PB_FR1_BIT_ALL                      ((uint8_t)0xFF)

#define GPIO_PC_OUTPUT_BIT_ALL                   ((uint8_t)0xFF)
#define GPIO_PC_PULLUP_BIT_ALL                   ((uint8_t)0xFF)
#define GPIO_PC_PULLDOWN_BIT_ALL                 ((uint8_t)0xFF)
#define GPIO_PC_OPEN_DRAIN_BIT_ALL               ((uint8_t)0xFF)
#define GPIO_PC_INPUT_BIT_ALL                    ((uint8_t)0xFF)
#define GPIO_PC_FR1_BIT_ALL                      ((uint8_t)0xFF)

#define GPIO_PD_OUTPUT_BIT_ALL                   ((uint8_t)0x7F)
#define GPIO_PD_PULLUP_BIT_ALL                   ((uint8_t)0x7F)
#define GPIO_PD_PULLDOWN_BIT_ALL                 ((uint8_t)0x7F)
#define GPIO_PD_OPEN_DRAIN_BIT_ALL               ((uint8_t)0x7F)
#define GPIO_PD_INPUT_BIT_ALL                    ((uint8_t)0x7F)
#define GPIO_PD_FR1_BIT_ALL                      ((uint8_t)0x7F)
#define GPIO_PD_FR2_BIT_ALL                      ((uint8_t)0x13)

#define GPIO_PE_OUTPUT_BIT_ALL                   ((uint8_t)0xFF)
#define GPIO_PE_PULLUP_BIT_ALL                   ((uint8_t)0xFF)
#define GPIO_PE_PULLDOWN_BIT_ALL                 ((uint8_t)0xFF)
#define GPIO_PE_OPEN_DRAIN_BIT_ALL               ((uint8_t)0xFF)
#define GPIO_PE_INPUT_BIT_ALL                    ((uint8_t)0xFF)
#define GPIO_PE_FR1_BIT_ALL                      ((uint8_t)0xFF)
#define GPIO_PE_FR2_BIT_ALL                      ((uint8_t)0xD4)

#define GPIO_PF_OUTPUT_BIT_ALL                   ((uint8_t)0x1F)
#define GPIO_PF_PULLUP_BIT_ALL                   ((uint8_t)0x1F)
#define GPIO_PF_PULLDOWN_BIT_ALL                 ((uint8_t)0x1F)
#define GPIO_PF_OPEN_DRAIN_BIT_ALL               ((uint8_t)0x1F)
#define GPIO_PF_INPUT_BIT_ALL                    ((uint8_t)0x1F)
#define GPIO_PF_FR1_BIT_ALL                      ((uint8_t)0x1F)
#define GPIO_PF_FR2_BIT_ALL                      ((uint8_t)0x1C)
#define GPIO_PF_FR3_BIT_ALL                      ((uint8_t)0x04)

#define GPIO_PG_OUTPUT_BIT_ALL                   ((uint8_t)0xFF)
#define GPIO_PG_PULLUP_BIT_ALL                   ((uint8_t)0xFF)
#define GPIO_PG_PULLDOWN_BIT_ALL                 ((uint8_t)0xFF)
#define GPIO_PG_OPEN_DRAIN_BIT_ALL               ((uint8_t)0xFF)
#define GPIO_PG_INPUT_BIT_ALL                    ((uint8_t)0xFF)
#define GPIO_PG_FR1_BIT_ALL                      ((uint8_t)0xFF)

#define GPIO_PH_OUTPUT_BIT_ALL                   ((uint8_t)0xFF)
#define GPIO_PH_PULLUP_BIT_ALL                   ((uint8_t)0xFF)
#define GPIO_PH_PULLDOWN_BIT_ALL                 ((uint8_t)0xFF)
#define GPIO_PH_OPEN_DRAIN_BIT_ALL               ((uint8_t)0xFF)
#define GPIO_PH_INPUT_BIT_ALL                    ((uint8_t)0xFF)
#define GPIO_PH_FR1_BIT_ALL                      ((uint8_t)0x07)

#define GPIO_PI_OUTPUT_BIT_ALL                   ((uint8_t)0x0F)
#define GPIO_PI_PULLUP_BIT_ALL                   ((uint8_t)0x0F)
#define GPIO_PI_PULLDOWN_BIT_ALL                 ((uint8_t)0x0F)
#define GPIO_PI_OPEN_DRAIN_BIT_ALL               ((uint8_t)0x0F)
#define GPIO_PI_INPUT_BIT_ALL                    ((uint8_t)0x0F)

#define GPIO_PJ_OUTPUT_BIT_ALL                   ((uint8_t)0xFF)
#define GPIO_PJ_PULLUP_BIT_ALL                   ((uint8_t)0xFF)
#define GPIO_PJ_PULLDOWN_BIT_ALL                 ((uint8_t)0xFF)
#define GPIO_PJ_OPEN_DRAIN_BIT_ALL               ((uint8_t)0xFF)
#define GPIO_PJ_INPUT_BIT_ALL                    ((uint8_t)0xFF)
#define GPIO_PJ_FR1_BIT_ALL                      ((uint8_t)0xC0)

#define GPIO_PK_OUTPUT_BIT_ALL                   ((uint8_t)0x03)
#define GPIO_PK_PULLUP_BIT_ALL                   ((uint8_t)0x03)
#define GPIO_PK_PULLDOWN_BIT_ALL                 ((uint8_t)0x03)
#define GPIO_PK_OPEN_DRAIN_BIT_ALL               ((uint8_t)0x03)
#define GPIO_PK_INPUT_BIT_ALL                    ((uint8_t)0x03)
#define GPIO_PK_FR1_BIT_ALL                      ((uint8_t)0x03)

#define GPIO_PL_INPUT_BIT_ALL                    ((uint8_t)0x03)
#define GPIO_PL_FR1_BIT_ALL                      ((uint8_t)0x03)

#define GPIO_PM_OUTPUT_BIT_ALL                   ((uint8_t)0x03)
#define GPIO_PM_PULLUP_BIT_ALL                   ((uint8_t)0x03)
#define GPIO_PM_PULLDOWN_BIT_ALL                 ((uint8_t)0x03)
#define GPIO_PM_OPEN_DRAIN_BIT_ALL               ((uint8_t)0x03)
#define GPIO_PM_INPUT_BIT_ALL                    ((uint8_t)0x03)

#define GPIO_PN_OUTPUT_BIT_ALL                   ((uint8_t)0x0F)
#define GPIO_PN_PULLUP_BIT_ALL                   ((uint8_t)0x0F)
#define GPIO_PN_PULLDOWN_BIT_ALL                 ((uint8_t)0x0F)
#define GPIO_PN_OPEN_DRAIN_BIT_ALL               ((uint8_t)0x0F)
#define GPIO_PN_INPUT_BIT_ALL                    ((uint8_t)0x0F)
#define GPIO_PN_FR1_BIT_ALL                      ((uint8_t)0x0F)

#define IS_GPIO_PA_DATA_BIT(param)      (((param) == GPIO_BIT_0)|| \
                                         ((param) == GPIO_BIT_1)|| \
                                         ((param) == GPIO_BIT_2)|| \
                                         ((param) == GPIO_BIT_3)|| \
                                         ((param) == GPIO_BIT_4)|| \
                                         ((param) == GPIO_BIT_5)|| \
                                         ((param) == GPIO_BIT_6)|| \
                                         ((param) == GPIO_BIT_7))

#define IS_GPIO_PB_DATA_BIT(param)      (((param) == GPIO_BIT_0)|| \
                                         ((param) == GPIO_BIT_1)|| \
                                         ((param) == GPIO_BIT_2)|| \
                                         ((param) == GPIO_BIT_3)|| \
                                         ((param) == GPIO_BIT_4)|| \
                                         ((param) == GPIO_BIT_5)|| \
                                         ((param) == GPIO_BIT_6)|| \
                                         ((param) == GPIO_BIT_7))

#define IS_GPIO_PC_DATA_BIT(param)      (((param) == GPIO_BIT_0)|| \
                                         ((param) == GPIO_BIT_1)|| \
                                         ((param) == GPIO_BIT_2)|| \
                                         ((param) == GPIO_BIT_3)|| \
                                         ((param) == GPIO_BIT_4)|| \
                                         ((param) == GPIO_BIT_5)|| \
                                         ((param) == GPIO_BIT_6)|| \
                                         ((param) == GPIO_BIT_7))

